In [16]:
import pandas as pd
import numpy as np

In [85]:
import matplotlib.pyplot as plt

In [86]:
df = pd.read_csv('train.csv')
test = pd.read_csv('test.csv')

In [87]:
df.loc[df['Sex'] == 'male','Sex'] = 0
df.loc[df['Sex'] == 'female','Sex'] = 1
'''
Assign numeric values in Embarked as:
C(Cherbourg) = 1, 
Q(Queenstown) = 2, 
S(Southampton) = 3
'''
df.loc[df['Embarked'] == 'C','Embarked'] = 1
df.loc[df['Embarked'] == 'Q','Embarked'] = 2
df.loc[df['Embarked'] == 'S','Embarked'] = 3

In [88]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",0,22.0,1,0,A/5 21171,7.2500,NaN,3
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,1,0,PC 17599,71.2833,C85,1
2,3,1,3,"Heikkinen, Miss. Laina",1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,1,0,113803,53.1000,C123,3
4,5,0,3,"Allen, Mr. William Henry",0,35.0,0,0,373450,8.0500,NaN,3
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",0,27.0,0,0,211536,13.0000,NaN,3
887,888,1,1,"Graham, Miss. Margaret Edith",1,19.0,0,0,112053,30.0000,B42,3
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,NaN,1,2,W./C. 6607,23.4500,NaN,3
889,890,1,1,"Behr, Mr. Karl Howell",0,26.0,0,0,111369,30.0000,C148,1
890,891,0,3,"Dooley, Mr. Patrick",0,32.0,0,0,370376,7.7500,NaN,2

In [89]:
df1 = df.copy()
df1.drop(columns = ['Name','Ticket','Cabin','Survived'],inplace=True)

In [90]:
df1

     PassengerId  Pclass Sex   Age  SibSp  Parch     Fare Embarked
0              1       3   0  22.0      1      0   7.2500        3
1              2       1   1  38.0      1      0  71.2833        1
2              3       3   1  26.0      0      0   7.9250        3
3              4       1   1  35.0      1      0  53.1000        3
4              5       3   0  35.0      0      0   8.0500        3
..           ...     ...  ..   ...    ...    ...      ...      ...
886          887       2   0  27.0      0      0  13.0000        3
887          888       1   1  19.0      0      0  30.0000        3
888          889       3   1   NaN      1      2  23.4500        3
889          890       1   0  26.0      0      0  30.0000        1
890          891       3   0  32.0      0      0   7.7500        2

[891 rows x 8 columns]

In [96]:
y = df['Survived']

In [91]:
from sklearn.impute import KNNImputer
imputer = KNNImputer(n_neighbors=3)
df_complete = imputer.fit_transform(df1)

In [138]:
df_complete

array([[8.92000e+02, 3.00000e+00, 0.00000e+00, ..., 0.00000e+00,
        7.82920e+00, 2.00000e+00],
       [8.93000e+02, 3.00000e+00, 1.00000e+00, ..., 0.00000e+00,
        7.00000e+00, 3.00000e+00],
       [8.94000e+02, 2.00000e+00, 0.00000e+00, ..., 0.00000e+00,
        9.68750e+00, 2.00000e+00],
       ...,
       [1.30700e+03, 3.00000e+00, 0.00000e+00, ..., 0.00000e+00,
        7.25000e+00, 3.00000e+00],
       [1.30800e+03, 3.00000e+00, 0.00000e+00, ..., 0.00000e+00,
        8.05000e+00, 3.00000e+00],
       [1.30900e+03, 3.00000e+00, 0.00000e+00, ..., 1.00000e+00,
        2.23583e+01, 1.00000e+00]])

In [98]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(df_complete, y, test_size=0.20, random_state=42)

In [106]:
from sklearn.ensemble import RandomForestClassifier
clf_rfc = RandomForestClassifier(max_depth=2, random_state=0)

In [107]:
clf_rfc.fit(X_train, y_train)

RandomForestClassifier(max_depth=2, random_state=0)

In [110]:
from sklearn.metrics import f1_score
print(clf_rfc.score(X_test,y_test))
print(f1_score(y_test,clf_rfc.predict(X_test),average=None,labels=[0,1]))

0.7597765363128491
[0.80888889 0.67669173]

In [109]:
from sklearn.linear_model import LinearRegression
clf_lmr = LinearRegression()
clf_lmr.fit(X_train, y_train)

LinearRegression()

In [112]:
print(clf_lmr.score(X_test,y_test))

0.4321932853312894

In [116]:
from sklearn.svm import SVC
clf_svm = SVC(gamma='auto')
clf_svm.fit(X_train, y_train)

SVC(gamma='auto')

In [118]:
print(clf_svm.score(X_test,y_test))
print(f1_score(y_test,clf_svm.predict(X_test),average=None,labels=[0,1]))

0.5865921787709497
[0.73758865 0.02631579]

In [121]:
from sklearn.naive_bayes import MultinomialNB 
clf_mnb = MultinomialNB()
clf_mnb.fit(X_train, y_train)

MultinomialNB()

In [122]:
print(clf_mnb.score(X_test,y_test))
print(f1_score(y_test,clf_mnb.predict(X_test),average=None,labels=[0,1]))

0.7094972067039106
[0.76785714 0.6119403 ]

In [123]:
from sklearn.neighbors import KNeighborsClassifier
clf_knc = KNeighborsClassifier()
clf_knc.fit(X_train, y_train)

KNeighborsClassifier()

In [124]:
print(clf_knc.score(X_test,y_test))
print(f1_score(y_test,clf_knc.predict(X_test),average=None,labels=[0,1]))

0.6759776536312849
[0.75423729 0.52459016]

In [126]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [129]:
test.loc[test['Sex'] == 'male','Sex'] = 0
test.loc[test['Sex'] == 'female','Sex'] = 1
'''
Assign numeric values in Embarked as:
C(Cherbourg) = 1, 
Q(Queenstown) = 2, 
S(Southampton) = 3
'''
test.loc[test['Embarked'] == 'C','Embarked'] = 1
test.loc[test['Embarked'] == 'Q','Embarked'] = 2
test.loc[test['Embarked'] == 'S','Embarked'] = 3

In [130]:
test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",0,34.5,0,0,330911,7.8292,NaN,2
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",1,47.0,1,0,363272,7.0000,NaN,3
2,894,2,"Myles, Mr. Thomas Francis",0,62.0,0,0,240276,9.6875,NaN,2
3,895,3,"Wirz, Mr. Albert",0,27.0,0,0,315154,8.6625,NaN,3
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",1,22.0,1,1,3101298,12.2875,NaN,3
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",0,NaN,0,0,A.5. 3236,8.0500,NaN,3
414,1306,1,"Oliva y Ocana, Dona. Fermina",1,39.0,0,0,PC 17758,108.9000,C105,1
415,1307,3,"Saether, Mr. Simon Sivertsen",0,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,3
416,1308,3,"Ware, Mr. Frederick",0,NaN,0,0,359309,8.0500,NaN,3
417,1309,3,"Peter, Master. Michael J",0,NaN,1,1,2668,22.3583,NaN,1

In [215]:
df3 = test.copy()
df3.drop(columns = ['Name','Ticket','Cabin'],inplace=True)

In [216]:
imputer = KNNImputer(n_neighbors=3)
df_complete1 = imputer.fit_transform(df3)

In [217]:
df_complete1

array([[8.92000e+02, 3.00000e+00, 0.00000e+00, ..., 0.00000e+00,
        7.82920e+00, 2.00000e+00],
       [8.93000e+02, 3.00000e+00, 1.00000e+00, ..., 0.00000e+00,
        7.00000e+00, 3.00000e+00],
       [8.94000e+02, 2.00000e+00, 0.00000e+00, ..., 0.00000e+00,
        9.68750e+00, 2.00000e+00],
       ...,
       [1.30700e+03, 3.00000e+00, 0.00000e+00, ..., 0.00000e+00,
        7.25000e+00, 3.00000e+00],
       [1.30800e+03, 3.00000e+00, 0.00000e+00, ..., 0.00000e+00,
        8.05000e+00, 3.00000e+00],
       [1.30900e+03, 3.00000e+00, 0.00000e+00, ..., 1.00000e+00,
        2.23583e+01, 1.00000e+00]])

In [218]:
m = clf_rfc.predict(df_complete1)
np_array = np.array(m)
series = pd.Series(np_array)

In [231]:
t = test['PassengerId']
series.name = 'Survived'
series

0      0
1      0
2      0
3      0
4      1
      ..
413    0
414    1
415    0
416    0
417    0
Name: Survived, Length: 418, dtype: int64

In [232]:
df_up = pd.DataFrame(t)
#df_up['Survived'] = df.index
#df_up.reset_index(drop = True,inplace=True)
df_up['Survived'] = series
print(df_up)

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [233]:
df_up.to_csv('output.csv',index=False)

In [234]:
df_up

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]